import React from "react";
import Navbar from "@/component/navbar/Navbar";
import styles from "../styles/newscontent.module.css";
import { TfiAlarmClock } from "react-icons/tfi";
import Actors from "@/component/factors/Actors";

export default function NewsContent() {
  return (
    <>
      <Navbar />
      <div className={styles.main}>
        <div className={styles.article}>
          {/* <div className={styles.img}> */}
          {/* <div > */}
          <img className={styles.image} src="../image/alice.jpg" alt="" />
          {/* </div> */}
          <div className={styles.descrip}>
            <h1 className={styles.title}>
              تایتل خبر لورممممممممممممممممممممممممممم
            </h1>
            <p className={styles.Clock}>
              زمان تقریبی مطالعه : دو دقیقه <TfiAlarmClock />{" "}
            </p>
            <p className={styles.description}>
              دانلود زیرنویس فیلم Alice 2022 آلیس یک فیلم مهیج آمریکایی محصول
              ۲۰۲۲ به نویسندگی و کارگردانی کریستین ور لیندن در اولین کارگردانی
              خود است. در این فیلم کیک پالمر، جانی لی میلر، کامن، گایوس چارلز و
              آلیشیا ویت به ایفای نقش پرداخته اند. برای دانلود به لینک زیر
              مراجعه کنید https://blue-subtitle.com/alice-2022/ اولین نمایش آن
              دانلود زیرنویس فیلم Alice 2022 آلیس یک فیلم مهیج آمریکایی محصول
              ۲۰۲۲ به نویسندگی و کارگردانی کریستین ور لیندن در اولین کارگردانی
              خود است. در این فیلم کیک پالمر، جانی لی میلر، کامن، گایوس چارلز و
              آلیشیا ویت به ایفای نقش پرداخته اند. دانلود زیرنویس فیلم Alice
              2022 آلیس یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به نویسندگی و کارگردانی
              کریستین ور لیندن در اولین کارگردانی خود است. در این فیلم کیک
              پالمر، جانی لی میلر، کامن، گایوس چارلز و آلیشیا ویت به ایفای نقش
              پرداخته اند. برای دانلود به لینک زیر مراجعه کنید
              https://blue-subtitle.com/alice-2022/ اولین نمایش آن دانلود
              زیرنویس فیلم Alice 2022 آلیس یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به
              نویسندگی و کارگردانی کریستین ور لیندن در اولین کارگردانی خود است.
              در این فیلم کیک پالمر، جانی لی میلر، کامن، گایوس چارلز و آلیشیا
              ویت به ایفای نقش پرداخته اند. دانلود زیرنویس فیلم Alice 2022 آلیس
              یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به نویسندگی و کارگردانی کریستین
              ور لیندن در اولین کارگردانی خود است. در این فیلم کیک پالمر، جانی
              لی میلر، کامن، گایوس چارلز و آلیشیا ویت به ایفای نقش پرداخته اند.
              برای دانلود به لینک زیر مراجعه کنید
              https://blue-subtitle.com/alice-2022/ اولین نمایش آن دانلود
              زیرنویس فیلم Alice 2022 آلیس یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به
              نویسندگی و کارگردانی کریستین ور لیندن در اولین کارگردانی خود است.
              در این فیلم کیک پالمر، جانی لی میلر، کامن، گایوس چارلز و آلیشیا
              ویت به ایفای نقش پرداخته اند. دانلود زیرنویس فیلم Alice 2022 آلیس
              یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به نویسندگی و کارگردانی کریستین
              ور لیندن در اولین کارگردانی خود است. در این فیلم کیک پالمر، جانی
              لی میلر، کامن، گایوس چارلز و آلیشیا ویت به ایفای نقش پرداخته اند.
              برای دانلود به لینک زیر مراجعه کنید
              https://blue-subtitle.com/alice-2022/ اولین نمایش آن دانلود
              زیرنویس فیلم Alice 2022 آلیس یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به
              نویسندگی و کارگردانی کریستین ور لیندن در اولین کارگردانی خود است.
              در این فیلم کیک پالمر، جانی لی میلر، کامن، گایوس چارلز و آلیشیا
              ویت به ایفای نقش پرداخته اند. دانلود زیرنویس فیلم Alice 2022 آلیس
              یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به نویسندگی و کارگردانی کریستین
              ور لیندن در اولین کارگردانی خود است. در این فیلم کیک پالمر، جانی
              لی میلر، کامن، گایوس چارلز و آلیشیا ویت به ایفای نقش پرداخته اند.
              برای دانلود به لینک زیر مراجعه کنید
              https://blue-subtitle.com/alice-2022/ اولین نمایش آن دانلود
              زیرنویس فیلم Alice 2022 آلیس یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به
              نویسندگی و کارگردانی کریستین ور لیندن در اولین کارگردانی خود است.
              در این فیلم کیک پالمر، جانی لی میلر، کامن، گایوس چارلز و آلیشیا
              ویت به ایفای نقش پرداخته اند. دانلود زیرنویس فیلم Alice 2022 آلیس
              یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به نویسندگی و کارگردانی کریستین
              ور لیندن در اولین کارگردانی خود است. در این فیلم کیک پالمر، جانی
              لی میلر، کامن، گایوس چارلز و آلیشیا ویت به ایفای نقش پرداخته اند.
              برای دانلود به لینک زیر مراجعه کنید
              https://blue-subtitle.com/alice-2022/ اولین نمایش آن دانلود
              زیرنویس فیلم Alice 2022 آلیس یک فیلم مهیج آمریکایی محصول ۲۰۲۲ به
              نویسندگی و کارگردانی کریستین ور لیندن در اولین کارگردانی خود است.
              در این فیلم کیک پالمر، جانی لی میلر، کامن، گایوس چارلز و آلیشیا
              ویت به ایفای نقش پرداخته اند.
            </p>
          </div>
        </div>
      </div>
    </>
  );
}
